ezois_ka/oooezoiskaobmen/src/Documents/ДанныеДляОформленияНаРаботу/ДанныеДляОформленияНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеДляОформленияНаРаботу</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДокумента</name>
    <type>
      <types>DefinedType.ОснованиеДанныхДляОформленияНаРаботу</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоОтсутствует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВид</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРожденияПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВБраке</name>
    <type>
      <types>DefinedType.СостояниеВБраке</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаПроживанияПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПроживанияСовпадаетСРегистрацией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПроживанияСовпадаетСВременнойРегистрацией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДанныхДляОформленияНаРаботу</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПолучены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарегистрированаОтправка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарегистрированаОтправкаУточнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеДанныхЗагружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеУточненияДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеДанные</name>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>CatalogRef.ТипыДанныхДляОформленияНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>Запрашивать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПриняты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлыПриняты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлыОтсутствуют</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПовторноЗапрашиваемыеДанные</name>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>CatalogRef.ТипыДанныхДляОформленияНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>Запрашивать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Enums/СостоянияДанныхДляОформленияНаРаботу/СостоянияДанныхДляОформленияНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДанныхДляОформленияНаРаботу</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ДанныеПолучены</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяУточнениеДанных</name>
  </enumValues>
  <enumValues>
    <name>ДанныеПриняты</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen/src/Enums/ТипыОбъектовИнтеграцияУправлениеПерсоналом/ТипыОбъектовИнтеграцияУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовИнтеграцияУправлениеПерсоналом</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Должность</name>
  </enumValues>
  <enumValues>
    <name>ДолжностьПоШтатномуРасписанию</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>ГрафикРаботы</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусковПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусковПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ВерсииФормата</name>
  </enumValues>
  <enumValues>
    <name>ВсеИзменения</name>
  </enumValues>
  <enumValues>
    <name>ВидПредоставляемойСотрудникамСправки</name>
  </enumValues>
  <enumValues>
    <name>Оффер</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеДоступаКРабочимКонтактам</name>
  </enumValues>
  <enumValues>
    <name>ДоступныеФункцииФизическогоЛица</name>
  </enumValues>
  <enumValues>
    <name>ДокументНаПодпись</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаПрисоединениеКЭДОБЗК</name>
  </enumValues>
  <enumValues>
    <name>МашиночитаемаяДоверенность</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправкиСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаИзменениеЛичныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНалоговыйВычет</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаКомпенсациюОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаОстаткиОтпусков</name>
  </enumValues>
  <enumValues>
    <name>Отсутствие</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаДСВ</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ЗаработанныеПраваНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ПрименяемыеВычетыНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ПраздничныеДниГрафикаРаботы</name>
  </enumValues>
  <enumValues>
    <name>РезультатСогласования</name>
  </enumValues>
  <enumValues>
    <name>ПравилоСогласования</name>
  </enumValues>
  <enumValues>
    <name>РасчетныйЛисток</name>
  </enumValues>
  <enumValues>
    <name>ПлановоеУдержание</name>
  </enumValues>
  <enumValues>
    <name>БудущееИзменениеОстаткаОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ДанныеГрафикаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОбИспользованииОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ВидСоставнойЧастиЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>Справка2НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>СправкаСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>СправкаОстаткиОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ИспользуемаяФункциональность</name>
  </enumValues>
  <enumValues>
    <name>НастройкиЗаявленийНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ДоступностьПриложения</name>
  </enumValues>
  <enumValues>
    <name>ШаблонДокумента</name>
  </enumValues>
  <enumValues>
    <name>ОбращениеСотрудника</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаЗарплатаСразу</name>
  </enumValues>
  <enumValues>
    <name>РабочееМестоОхраныТруда</name>
  </enumValues>
  <enumValues>
    <name>ВидОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиОтпусков</name>
  </enumValues>
  <enumValues>
    <name>НастройкиОтсутствий</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОПриложении</name>
  </enumValues>
  <enumValues>
    <name>НастройкиПриложения</name>
  </enumValues>
  <enumValues>
    <name>ВнешнееФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаПереносОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОтменаЗаявки</name>
  </enumValues>
  <enumValues>
    <name>НастройкиСервисаПодписания</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаУчебныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>МедицинскиеОсмотры</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхДляОформленияНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>ДанныеДляОформленияНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеПособиеПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеПособиеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзОтпускаПоУходуЗаРебенком</name>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen/src/Documents/ДанныеДляОформленияНаРаботу/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
			ИдентификаторДокумента = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Ответственный) Тогда
			ЗаполняемыеЗначения = Новый Структура("Ответственный");
			ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаполняемыеЗначения);
		КонецЕсли;
	Иначе
		Если ПометкаУдаления И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") Тогда
			ДополнительныеСвойства.Вставить("УстановленаПометкаУдаления", Истина);
			Если Состояние = Перечисления.СостоянияДанныхДляОформленияНаРаботу.ДанныеПриняты Тогда
				ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Данные для оформления приняты. Пометка на удаление ""%1"" не предусмотрена'"),
					Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	УстановленаПометкаУдаления = Неопределено;
	ДополнительныеСвойства.Свойство("УстановленаПометкаУдаления", УстановленаПометкаУдаления);
	Если УстановленаПометкаУдаления = Истина Или Состояние = Перечисления.СостоянияДанныхДляОформленияНаРаботу.Аннулирован Тогда
		
		МенеджерЗаписи = РегистрыСведений.ВыгруженныеОбъектыУправлениеПерсоналом.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ссылка 		= Ссылка;
		МенеджерЗаписи.Приложение 	= Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника;
		МенеджерЗаписи.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗапросДанныхДляОформленияНаРаботу;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи = РегистрыСведений.ИзмененияДляОбменаКабинетСотрудника.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Ссылка 		= Ссылка;
			МенеджерЗаписи.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗапросДанныхДляОформленияНаРаботу;
			МенеджерЗаписи.Прочитать();
			ЗарегистрироватьУдаление = Истина;
			Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.ВыгружатьУдаление Тогда
				ЗарегистрироватьУдаление = Ложь;
			КонецЕсли;
			
			Если ЗарегистрироватьУдаление Тогда
				МенеджерЗаписи.Ссылка 		= Ссылка;
				МенеджерЗаписи.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗапросДанныхДляОформленияНаРаботу;
				МенеджерЗаписи.ВерсияДанных = Строка(Новый УникальныйИдентификатор);
				МенеджерЗаписи.ВыгружатьУдаление = Истина;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ВызватьИсключение НСтр("ru = 'Создание документа копированием не поддерживается'");
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
